[
  {
    "type": "effect_on_condition",
    "id": "EOC_PORTAL_STORM_PSION_AWAKENING",
    "global": true,
    "recurrence": [ "2 minutes", "5 minutes" ],
    "condition": { "and": [ 
      "u_is_outside",  
      { "is_weather": "portal_storm" }, 
      { "compare_int": [ { "global_val": "var", "var_name": "ps_str" }, ">", { "const": 3 } ] },  
      { "one_in_chance": 30 },
      { "not": { "u_has_worn_with_flag": "PORTAL_PROOF" } },
      { "not": { "u_has_effect": "sleep" } }
    ] },
    "deactivate_condition": { "not": { "is_weather": "portal_storm" } },
    "effect": {
      "weighted_list_eocs": [
      [ "EOC_PORTAL_BIOKIN_AWAKENING", { "const": 1 } ],
      [ "EOC_PORTAL_CLAIR_AWAKENING", { "const": 1 } ],
      [ "EOC_PORTAL_PYRO_AWAKENING", { "const": 1 } ],
      [ "EOC_PORTAL_TELEKIN_AWAKENING", { "const": 1 } ],
      [ "EOC_PORTAL_TEEP_AWAKENING", { "const": 1 } ],
      [ "EOC_PORTAL_PORTER_AWAKENING", { "const": 1 } ],
      [ "EOC_PORTAL_VITA_AWAKENING", { "const": 1 } ]
       ]
      }
  },
  {
    "type": "effect_on_condition",
    "id": "EOC_PORTAL_BIOKIN_AWAKENING",
    "effect": [
      { "u_add_trait": "BIOKINETIC" }, 
      { "u_add_trait": "BIOKIN_NEEDS" }, 
      { "u_message": "A roar fills your mind, louder even than the screaming madness of the portal storm.  New strength and vigor suddenly fills you.  You stand up straight and tall, heedless of the wind and the kaleidoscoping sky, and clench your fist.  You feel like you could take on the world, like you could sprint for an hour without stopping, like you could wrestle one of those giant insects to the ground and pin it, like you could dodge bullets.  You unclench your fist and shake your head, but the sense of strength remains." } ]
  },
  {
    "type": "effect_on_condition",
    "id": "EOC_PORTAL_CLAIR_AWAKENING",
    "effect": [
      { "u_add_trait": "CLAIRSENTIENT" }, 
      { "u_add_trait": "CLAIR_SENSES" }, 
      { "u_message": "A roar fills your mind, louder even than the screaming madness of the portal storm.  You close your eyes but you can still see--at first just a light against your eyelids, then like a train approaching the end of a tunnel, light expands and reveals your surroundings.  You can see in all directions.  You can see behind and beneath every blade of grass around you, illuminated in the storm's witchlight, for a just a moment until your awareness snaps back into your body and you reel with the shock of it.  When you open your eyes again, the colors around you are brighter and the sounds are clearer than before." } ]
  },
  {
    "type": "effect_on_condition",
    "id": "EOC_PORTAL_PYRO_AWAKENING",
    "effect": [
      { "u_add_trait": "PYROKINETIC" }, 
      { "u_add_trait": "PYROGLOW_WEAK" },
      { "u_add_trait": "PYROGLOW_STRONG" },
      { "u_message": "A roar fills your mind, louder even than the screaming madness of the portal storm.  You stretch out your hand toward the shattering sky and a glow gathers around it as the air itself begins to shine.  The glow brightens and then flames arise, dancing on the open area above your palm.  You move your hand and the flames move with it, swirling around you, and with a wave of your hand they scatter into the air.  The glow fades, but the sensation of heat remains." } ]
  },
  {
    "type": "effect_on_condition",
    "id": "EOC_PORTAL_TELEKIN_AWAKENING",
    "effect": [
      { "u_add_trait": "TELEKINETIC" }, 
      { "u_add_trait": "TELEKINETIC_CARRY" }, 
      { "u_message": "A roar fills your mind, louder even than the screaming madness of the portal storm.  You look around for shelter, but you're out in the open.  You reach down toward the ground but the ground starts rising--bits of grass and rock and dirt lifting up and swirling around you.  The roar in your head grows louder as you slowly rise off the ground, the debris around you whirling faster and faster, until the your mind suddenly stills and you collapse back to the earth with a thump.  The pebbles around start to fall--but one catches your eye, and as you look at it, it stops and hovers in the air for a moment." } ]
  },
  {
    "type": "effect_on_condition",
    "id": "EOC_PORTAL_TEEP_AWAKENING",
    "effect": [
      { "u_add_trait": "TELEPATH" }, 
      { "u_add_trait": "TELEPATHIC_SUGGESTION" }, 
      { "u_message": "A roar fills your mind, louder even than the screaming madness of the portal storm.  A babble of voices, male, female, neither, both, and some not human at all, speaking to you.  The world is rapidly dying.  The dead and the fungus and the plants will fight over what remains and there will be nothing left for humanity.  Stay out here, where realities converge and walk into a better tomorrow.  As the voices blend together, the volume rising, you reach inside your own mind somehow and twist--and are greeted with blessed silence.  Though the portal storm still rages, internally you are calm." } ]
  },
  {
    "type": "effect_on_condition",
    "id": "EOC_PORTAL_PORTER_AWAKENING",
    "effect": [
      { "u_add_trait": "TELEPORTER" }, 
      { "u_add_trait": "TELEPORTER_PROTECT" }, 
      { "u_message": "A roar fills your mind, louder even than the screaming madness of the portal storm.  Reality grows thin--you can see the spaces between molecules, larger by far than the distances at a larger scale.  You see the paths you could take to slip between them, to traverse space in an instant without any obstacles in between.  As the distances collapse and reality grows solid once again, that knowledge remains with you." } ]
  },
  {
    "type": "effect_on_condition",
    "id": "EOC_PORTAL_VITA_AWAKENING",
    "effect": [
      { "u_add_trait": "VITAKINETIC" }, 
      { "u_add_trait": "VITAKINETIC_HEALTH" }, 
      { "u_message": "A roar fills your mind, louder even than the screaming madness of the portal storm.  For a moment, you can feel the blood flowing in your veins, every blood cell traveling through your body on its way to your cells.  You can feel the oxygen in your lungs cross through into your blood.  The howling of the portal storm pulses in time with your heartbeat for a moment before your awareness fades, but a lingering trace of it remains in the back of your mind." } ]
  }  
]
